#include <iostream>
using namespace std;


int main()
{
	//For11. Дано целое число N (> 0). 
	//Найти сумму N^2 + (N + 1)^2 + (N + 2)^2 + . . . + (2·N)^2
	//double N = 3;
	//int S = 0;
	//for (int i = 0; i <= N; i++)
	//{
	//	S += pow(N + i, 2);
	//	cout << pow(N + i, 2) << endl;
	//}
	//cout << S << endl;
	
	//For13. Дано целое число N(> 0).Найти значение выражения
	//	1.1 − 1.2 + 1.3 − . . .
	//(N слагаемых, знаки чередуются). Условный оператор не использовать
	//double N = 2;
	//double S = 1;
	//double K = 0;
	//for (double i = 1.1; i <= N; i += 0.1)
	//{
	//	S += pow(-1, K) * i;
	//	cout << pow(-1, K) * i << endl;
	//	K++;
	//}
	//cout << S << endl;

	//For14. Дано целое число N(> 0).Найти квадрат данного числа, используя для
	//	его вычисления следующую формулу :
	//N ^ 2 = 1 + 3 + 5 + . . . + (2·N − 1).
	//	После добавления к сумме каждого слагаемого выводить текущее значение суммы
	//	(в результате будут выведены квадраты всех целых чисел от 1 до N).
	//int N = 12;
	//int S = 0;
	//for (int i = 1; i <= N; i++)
	//{
	//	//где-то явно что-то упустил...
	//	S += (2 * i - 1);
	//	cout << "---> " << 2 * i - 1 << " Kвадрат данного числа: " << S << endl;
	//}
	
	//For 15. Дано вещественное число A и целое число N(> 0).Найти A в степени N :
//A^N = A·A· . ..·A (числа A перемножаются N раз).
	//double A = 1.4;
	//int N = 5;
	//int S = 1;
	//for (int i = 0; i < N; i++)
	//{
	//	S *= A;
	//}
	//cout << S << endl;
}
